amrincurveUP/CrustSense-SmartCrabSystem/firmware/CurveUp_Smartaquaculture_System/sdkconfig.defaults
# ESP32-S3-DevKitC-1 N16R8 (16 MB flash, 8 MB octal PSRAM)
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_40M=y

CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
